retornaz/contiki-cc253x/cpu/cc253x/dev/usb-arch.c
/*
Copyright (c) 2012, Philippe Retornaz
Copyright (c) 2012, EPFL STI IMT LSRO1 -- Mobots group
All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.
3. The name of the author may not be used to endorse or promote
   products derived from this software without specific prior
   written permission.

THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS
OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

#include <stdio.h>

#include "contiki.h"
#include "usb/usb-arch.h"
#include "p2-intr.h"

#include "cc253x.h"
#include "sfr-bits.h"
#include "port.h"

#include "dma.h"

// P1_0
#define USB_PULLUP_PORT 	1
#define USB_PULLUP_PIN		0

#define USBCTRL_USB_EN 		(1 << 0)
#define USBCTRL_PLL_EN 		(1 << 1)
#define USBCTRL_PLL_LOCKED	(1 << 7)

#define USBIIE_EP0IE		(1 << 0)
#define USBIIE_INEPxIE(x)	(1 << x)

#define USBOIE_OUEPxIE(x)	(1 << x)

#define USBCSxH_ISO		(1 << 6)

#define USBCS0_CLR_SETUP_END	(1 << 7)
#define USBCS0_CLR_OUTPKT_RDY	(1 << 6)
#define USBCS0_SEND_STALL	(1 << 5)
#define USBCS0_SETUP_END	(1 << 4)
#define USBCS0_DATA_END		(1 << 3)
#define USBCS0_SENT_STALL	(1 << 2)
#define USBCS0_INPKT_RDY	(1 << 1)
#define USBCS0_OUTPKT_RDY	(1 << 0)

#define USBCSIL_SENT_STALL	(1 << 5)
#define USBCSIL_SEND_STALL	(1 << 4)
#define USBCSIL_FLUSH_PACKET	(1 << 3)
#define USBCSIL_UNDERRUN	(1 << 2)
#define USBCSIL_PKT_PRESENT	(1 << 1)
#define USBCSIL_INPKT_RDY	(1 << 0)

#define USBCSOL_SENT_STALL	(1 << 6)
#define USBCSOL_SEND_STALL	(1 << 5)
#define USBCSOL_OVERRUN		(1 << 2)
#define USBCSOL_OUTPKT_RDY	(1 << 0)


#ifdef DEBUG
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif


// Double buffering not used
// We assume only the IN or the OUT of 
// each endpoint is enabled and not both.
#if CTRL_EP_SIZE > 32
#error Control endpoint size too big
#endif

#if USB_EP1_SIZE > 32
#error Endpoint 1 size too big
#endif

#if USB_EP2_SIZE > 64
#error Endpoint 2 size too big
#endif

#if USB_EP3_SIZE > 128
#error Endpoint 3 size too big
#endif

#if USB_EP4_SIZE > 256
#error Endpoint 4 size too big
#endif

#if USB_EP5_SIZE > 512
#error Endpoint 5 size too big 
#endif


static const uint16_t ep_xfer_size[] =
  {
    CTRL_EP_SIZE,
    USB_EP1_SIZE,
    USB_EP2_SIZE,
    USB_EP3_SIZE,
    USB_EP4_SIZE,
    USB_EP5_SIZE,
  };

  
#define EP_IDLE 0
#define EP_RX 1
#define EP_TX 2
static uint8_t ep0Status;

typedef struct _USBEndpoint USBEndpoint;
struct _USBEndpoint
{
  uint8_t halted;
  uint8_t addr;
  uint8_t flags;
  USBBuffer *buffer;	/* NULL if no current buffer */
  struct process *event_process;
  unsigned int events;
  uint16_t xfer_size;
};

#define USB_EP_FLAGS_TYPE_MASK 0x03
#define USB_EP_FLAGS_TYPE_BULK 0x00
#define USB_EP_FLAGS_TYPE_CONTROL 0x01
#define USB_EP_FLAGS_TYPE_ISO 0x02
#define USB_EP_FLAGS_TYPE_INTERRUPT 0x03

#define USB_EP_FLAGS_ENABLED 	0x04
#define USB_EP_FLAGS_DATA_WAITING 0x08

#define EP_TYPE(ep) ((ep)->flags & USB_EP_FLAGS_TYPE_MASK)
#define IS_EP_TYPE(ep, type) (EP_TYPE(ep) == (type))
#define IS_CONTROL_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_CONTROL)
#define IS_BULK_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_BULK)
#define IS_INTERRUPT_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_INTERRUPT)
#define IS_ISO_EP(ep) IS_EP_TYPE(ep, USB_EP_FLAGS_TYPE_ISO)


#define USB_WRITE_BLOCK 0x01
#define USB_READ_BLOCK 0x01	/* The currently submitted buffers
				   can't hold the received data, wait
				   for more buffers. No data was read
				   from the hardware buffer */
#define USB_WRITE_NOTIFY 0x02
#define USB_READ_NOTIFY 0x02	/* Some buffers that had the
				   USB_BUFFER_NOTIFY flags set were
				   released */
#define USB_READ_FAIL	0x4


/* Index in endpoint array */
#define EP_INDEX(addr) ((addr) & 0x7f)

/* Get address of endpoint struct */
#define EP_STRUCT(addr) &usb_endpoints[EP_INDEX(addr)];

/* Number of hardware endpoint */
#define EP_HW_NUM(addr) ((addr) & 0x7f)

#define usb_irq_disable(flag) cc253x_p2_irq_disable(flag)
#define usb_irq_enable(flag) cc253x_p2_irq_enable(flag)

static uint8_t usb_irq(void);
static void usb_arch_epin_irq(uint8_t ep_hw);
static void usb_arch_epout_irq(uint8_t ep_hw);
static void usb_arch_ep0_irq(void);

static struct cc253x_p2_handler usb_irq_handler = {NULL,usb_irq};

static USBEndpoint usb_endpoints[USB_MAX_ENDPOINTS];
struct process *event_process = 0;
volatile static unsigned int events = 0;

static uint8_t ep0_tx(void);
static uint8_t ep_tx(uint8_t ep_hw);

static void
notify_process(unsigned int e)
{
  events |= e;
  if (event_process) {
    process_poll(event_process);
  }
}

static void
notify_ep_process(USBEndpoint *ep, unsigned int e)
{
  ep->events |= e;
  if (ep->event_process) {
    process_poll(ep->event_process);
  }
}


void
usb_set_ep_event_process(unsigned char addr, struct process *p)
{
  USBEndpoint *ep = EP_STRUCT(addr);
  ep->event_process = p;
}


void usb_arch_set_global_event_process(struct process *p) {
	event_process = p;
}

unsigned int usb_arch_get_global_events(void) {
	uint8_t flag;
	volatile unsigned int e;
	
	usb_irq_disable(flag);
	e = events;
	events = 0;
	usb_irq_enable(flag);
	
	return e;
}

unsigned int usb_get_ep_events(uint8_t addr) {
	volatile unsigned int e;
	uint8_t flag;
	USBEndpoint *ep = EP_STRUCT(addr);
	
	usb_irq_disable(flag);
	e = ep->events;
	ep->events = 0;
	usb_irq_enable(flag);
	
	return e;
}
#if DMA_ON
#ifndef USB_DMA_CHANNEL
#error You must set USB_DMA_CHANNEL to a valid dma channel.
#endif
static void read_hw_buffer_dma(uint8_t tl, uint8_t th, uint8_t __xdata * xptr, unsigned int len) {
	dma_conf[USB_DMA_CHANNEL].src_h = ((uint16_t) xptr) >> 8;
	dma_conf[USB_DMA_CHANNEL].src_l = ((uint16_t) xptr) & 0xFF;
	dma_conf[USB_DMA_CHANNEL].dst_h = th;
	dma_conf[USB_DMA_CHANNEL].dst_l = tl;
	
