retornaz/contiki-cc253x/cpu/cc253x/dev/usb-arch.c
	// Maximum USB len transfert is 512bytes, maximum DMA len: 4096, we are safe.
	dma_conf[USB_DMA_CHANNEL].len_h = len >> 8;
	dma_conf[USB_DMA_CHANNEL].len_l = len & 0xFF;
	dma_conf[USB_DMA_CHANNEL].wtt = DMA_T_NONE | DMA_BLOCK;
	// Maximum prio, we will be polling until the transfert is done.
	dma_conf[USB_DMA_CHANNEL].inc_prio = DMA_SRC_INC_NO | DMA_DST_INC_1 | DMA_PRIO_HIGH;

	DMA_ARM(USB_DMA_CHANNEL);
	// Wait until the channel is armed
	while(!(DMAARM & (1 << USB_DMA_CHANNEL)));

	DMA_TRIGGER(USB_DMA_CHANNEL);
	// Wait until the transfert is done.
	// For some unknown reason, the DMA channel do not set the IRQ flag
	// sometimes, so use the DMAARM bit to check if transfert is done
	while(DMAARM & (1 << USB_DMA_CHANNEL));
	// Clear interrupt flag
	DMAIRQ = ~(1 << USB_DMA_CHANNEL);
}
static void write_hw_buffer_dma(uint8_t __xdata * xptr, uint8_t fl, uint8_t fh, unsigned int len) {
	dma_conf[USB_DMA_CHANNEL].src_h = fh;
	dma_conf[USB_DMA_CHANNEL].src_l = fl;
	dma_conf[USB_DMA_CHANNEL].dst_h = ((uint16_t) xptr) >> 8;
	dma_conf[USB_DMA_CHANNEL].dst_l = ((uint16_t) xptr) & 0xFF;
	
	// Maximum USB len transfert is 512bytes, maximum DMA len: 4096, we are safe.
	dma_conf[USB_DMA_CHANNEL].len_h = len >> 8;
	dma_conf[USB_DMA_CHANNEL].len_l = len & 0xFF;
	dma_conf[USB_DMA_CHANNEL].wtt = DMA_T_NONE | DMA_BLOCK;
	// Maximum prio, we will be polling until the transfert is done.
	dma_conf[USB_DMA_CHANNEL].inc_prio = DMA_SRC_INC_1 | DMA_DST_INC_NO | DMA_PRIO_HIGH;

	DMA_ARM(USB_DMA_CHANNEL);
	// Wait until the channel is armed
	while(!(DMAARM & (1 << USB_DMA_CHANNEL)));

	DMA_TRIGGER(USB_DMA_CHANNEL);
	// Wait until the transfert is done.
	while(DMAARM & (1 << USB_DMA_CHANNEL));
	
	// Clear interrupt flag
	DMAIRQ = ~(1 << USB_DMA_CHANNEL);
}

#endif
static void read_hw_buffer(uint8_t * to, uint8_t hw_ep, unsigned int len) {
	__xdata uint8_t * from = &USBF0 + (hw_ep << 1);
#if DMA_ON
	// For small transfers we use PIO
	// This check is specific to SDCC and large/huge memory model
	if(len > 8 && ((uint8_t*) &to)[2] == 0x0 /* x data pointer */) {
		read_hw_buffer_dma(((uint8_t*) &to)[0], ((uint8_t*) &to)[1], from, len);
		return;
	}
#endif
	while(len--) {
		*to++ = *from;
	}
}

static void write_hw_buffer(uint8_t hw_ep, uint8_t * from, unsigned int len) {
	__xdata uint8_t * to = &USBF0 + (hw_ep << 1);
#if DMA_ON
	// For small transfers we use PIO
	if(len > 8 && ((uint8_t*) &from)[2] == 0x0 /* x data pointer */) {
		write_hw_buffer_dma(to,((uint8_t*) &from)[0], ((uint8_t*) &from)[1],len);
		return;
	}
#endif
	while(len--) {
		*to = *from++;
	}
}

static void
usb_arch_reset(void)
{
  uint8_t e;
  for (e = 0; e < USB_MAX_ENDPOINTS; e++) {
    if (usb_endpoints[e].flags &USB_EP_FLAGS_ENABLED) {
      USBBuffer *buffer = usb_endpoints[e].buffer;
      usb_endpoints[e].flags = 0;
      usb_disable_endpoint(e);
      while(buffer) {
	buffer->flags &= ~USB_BUFFER_SUBMITTED;
	buffer = buffer->next;
      }
    }
  }
  usb_arch_setup_control_endpoint(0);  
}

/* Init USB */
void usb_arch_setup(void) {
	uint8_t i;

	/* Switch on USB PLL & USB module */
	USBCTRL = USBCTRL_USB_EN | USBCTRL_PLL_EN; 

	/* Wait until USB PLL is stable */
	while(!(USBCTRL & USBCTRL_PLL_LOCKED));

	/* Enable pull-up on usb port */
	PORT_SET(USB_PULLUP_PORT, USB_PULLUP_PIN);
	PORT_DIR_OUTPUT(USB_PULLUP_PORT,USB_PULLUP_PIN);
	
	for(i = 0; i < USB_MAX_ENDPOINTS; i++) {
		usb_endpoints[i].flags = 0;
		usb_endpoints[i].event_process = 0;
	}
	
	usb_arch_reset();
	
	// Disable all endpoints interrupts
	// Enpoint 0 interrupt will be enabled later
	USBIIE = 0;
	USBOIE = 0;
	
	cc253x_p2_register_handler(&usb_irq_handler);
	// We have to force IRQ enable as we might be the first user
	cc253x_p2_irq_force_enable();
}

void usb_submit_recv_buffer(uint8_t addr, USBBuffer * buffer) {
	USBBuffer **tailp;
	uint8_t flag;
	USBEndpoint *ep = EP_STRUCT(addr);

	if(!(ep->flags & USB_EP_FLAGS_ENABLED)) {
		return;
	}
	
	if(buffer->data == NULL && EP_HW_NUM(addr) == 0) {
                // the usb-core is trying to get the STATUS packet (ZLP in this case)
                // but the USB hardware is catching them, thus ignore this.
                // FIXME: Use the interrupt to release this buffer when the packet is sent
                // at least the timing would be better ... 
                notify_ep_process(ep,USB_EP_EVENT_NOTIFICATION);
                return;
        }

	usb_irq_disable(flag);

	tailp = &ep->buffer;
	while(*tailp) {
		tailp = &(*tailp)->next;
	}
	*tailp = buffer;
	while(buffer) {
		buffer->flags |= USB_BUFFER_SUBMITTED;
		buffer = buffer->next;
	}
	
	if(ep->flags & USB_EP_FLAGS_DATA_WAITING) {
		if(!EP_HW_NUM(ep->addr)) {
			usb_arch_ep0_irq();
		} else {
			usb_arch_epout_irq(EP_HW_NUM(ep->addr));
		}
	}
	
	usb_irq_enable(flag);
}

void usb_submit_xmit_buffer(uint8_t addr, USBBuffer * buffer) {
	USBBuffer **tailp;
	uint8_t flag;
	uint8_t res;
	USBEndpoint *ep = EP_STRUCT(addr);
	
	if(!(ep->flags & USB_EP_FLAGS_ENABLED)) {
		return;
	}
	
	usb_irq_disable(flag);


	if(EP_HW_NUM(addr) == 0) {
		if(buffer->data == NULL) {
			// We are asked to send a STATUS packet.
			// But the USB hardware is doing this automatically
			// as soon as we release hw FIFO.
			USBINDEX = 0;
			USBCS0 = USBCS0_CLR_OUTPKT_RDY | USBCS0_DATA_END;
			notify_ep_process(ep,USB_EP_EVENT_NOTIFICATION);
			usb_irq_enable(flag);
			return;
		} else {
			// Release the hw FIFO ...
			USBINDEX = 0;
			USBCS0 = USBCS0_CLR_OUTPKT_RDY;
		}
	}
	
	tailp = &ep->buffer;
	while(*tailp) {
		tailp = &(*tailp)->next;
	}
	*tailp = buffer;
	while(buffer) {
		buffer->flags |= USB_BUFFER_SUBMITTED | USB_BUFFER_IN;
		buffer = buffer->next;
	}
	
	USBINDEX = EP_HW_NUM(ep->addr);
	if(EP_HW_NUM(ep->addr)) {
		res = ep_tx(EP_HW_NUM(ep->addr));
	} else {
		res = ep0_tx();
	}
	
	usb_irq_enable(flag);
	
	if(res & USB_WRITE_NOTIFY) {
		notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
	}

}


static void usb_arch_setup_endpoint0(void) {
	USBIIE |= USBIIE_EP0IE;
}

static void usb_arch_setup_in_endpoint(uint8_t addr) {
	uint8_t ei = EP_HW_NUM(addr);
	USBEndpoint *ep = EP_STRUCT(addr);
	
	// Enable interrupt
	USBIIE |= USBIIE_INEPxIE(ei);
	
	// Set internal FIFO size
	USBMAXI = ep->xfer_size / 8;
	
	if(IS_ISO_EP(ep)) {
		USBCSIH |= USBCSxH_ISO;
	} else {
		USBCSIH &= ~USBCSxH_ISO;
	}
}

static void usb_arch_setup_out_endpoint(uint8_t addr) {
	uint8_t ei = EP_HW_NUM(addr);
	USBEndpoint *ep = EP_STRUCT(addr);
	
	// Enable interrupt
	USBOIE |= USBOIE_OUEPxIE(ei);
	
	// Set internal FIFO size
	USBMAXO = ep->xfer_size / 8;

	if(IS_ISO_EP(ep)) {
		USBCSOH |= USBCSxH_ISO;
	} else {
		USBCSOH &= ~USBCSxH_ISO;
	}
}

static void usb_arch_setup_endpoint(uint8_t addr) {
	uint8_t ei = EP_HW_NUM(addr);
	uint8_t flag;
	USBEndpoint *ep = EP_STRUCT(addr);
	
	ep->halted = 0;
	ep->flags |= USB_EP_FLAGS_ENABLED;
	ep->buffer = 0;
	ep->addr = addr;
	ep->events = 0;
	ep->xfer_size = ep_xfer_size[ei];

	usb_irq_disable(flag);
	// Select endpoint banked register
	USBINDEX = ei;
	
	// special case for ep 0
	if(ei == 0) {
		usb_arch_setup_endpoint0();
	} else {
		if(addr & 0x80) {
			usb_arch_setup_in_endpoint(addr);
		} else {
			usb_arch_setup_out_endpoint(addr);
		}
	}
	usb_irq_enable(flag);
}

void usb_arch_setup_iso_endpoint(uint8_t addr) {
	USBEndpoint * ep = EP_STRUCT(addr);
	ep->flags = USB_EP_FLAGS_TYPE_ISO;
	
	usb_arch_setup_endpoint(addr);
}

void usb_arch_setup_control_endpoint(uint8_t addr) {
	USBEndpoint * ep = EP_STRUCT(addr);
	ep->flags = USB_EP_FLAGS_TYPE_CONTROL;
	
	usb_arch_setup_endpoint(addr);
}

void usb_arch_setup_bulk_endpoint(uint8_t addr) {
	USBEndpoint * ep = EP_STRUCT(addr);
	ep->flags = USB_EP_FLAGS_TYPE_BULK;
	
	usb_arch_setup_endpoint(addr);
}

void usb_arch_setup_interrupt_endpoint(uint8_t addr) {
	USBEndpoint * ep = EP_STRUCT(addr);
	ep->flags = USB_EP_FLAGS_TYPE_INTERRUPT;
	
	usb_arch_setup_endpoint(addr);
}

static void usb_arch_disable_ep0(void) {
	USBIIE &= ~USBIIE_EP0IE;
	USBCS0 = 0xC0; // Clear any pending status flags
}

