retornaz/contiki-cc253x/cpu/cc253x/dev/usb-arch.c
static void usb_arch_disable_in_endpoint(uint8_t addr) {
	USBMAXI = 0;
	USBIIE &= ~USBIIE_INEPxIE(EP_HW_NUM(addr));
	
	// Flush any pending packets
	USBCSIL = 0x08; // Double-buffering not used. Flush only once
}

static void usb_arch_disable_out_endpoint(uint8_t addr) {
	USBMAXO = 0;
	USBOIE &= ~USBOIE_OUEPxIE(EP_HW_NUM(addr));
	
	// Flush any pending packets
	USBCSOL = 0x08; // Double buffering not used, flush only once
}


void usb_arch_disable_endpoint(uint8_t addr) {
	uint8_t ei = EP_HW_NUM(addr);
	uint8_t flag;
	USBEndpoint *ep = EP_STRUCT(addr);
	
	ep->flags &= ~USB_EP_FLAGS_ENABLED;
	
	usb_irq_disable(flag);
	USBINDEX = ei;
	if(ei == 0) {
		usb_arch_disable_ep0();
	} else {
		if(addr & 0x80) {
			usb_arch_disable_in_endpoint(addr);
		} else {
			usb_arch_disable_out_endpoint(addr);
		}
	}
	usb_irq_enable(flag);
}

void usb_arch_discard_all_buffers(uint8_t addr) {
	USBBuffer * buffer;
	uint8_t flag;
	volatile USBEndpoint *ep = EP_STRUCT(addr);
	
	usb_irq_disable(flag);
	buffer = ep->buffer;
	ep->buffer = NULL;
	usb_irq_enable(flag);
	
	while(buffer) {
		buffer->flags &= ~USB_BUFFER_SUBMITTED;
		buffer = buffer->next;
	}
}	

static void set_stall(uint8_t addr, uint8_t stall) {
	uint8_t ei = EP_HW_NUM(addr);
	USBINDEX = ei;
	if(ei == 0) { 
		// Stall is automatically deasserted on EP0
		if(stall)  {
			ep0Status = EP_IDLE;
			USBCS0 |= USBCS0_SEND_STALL | USBCS0_OUTPKT_RDY;
		}
	} else {
		if(addr & 0x80) {
			if(stall) {
				USBCSIL |= USBCSIL_SEND_STALL;
			} else {
				USBCSIL &= ~USBCSIL_SEND_STALL;
			}
		} else {
			if(stall) {
				USBCSOL |= USBCSOL_SEND_STALL;
			} else {
				USBCSOL &= ~USBCSOL_SEND_STALL;
			}
		}
	}
}

void usb_arch_control_stall(uint8_t addr) {
	uint8_t ei = EP_HW_NUM(addr);
	uint8_t flag;
	if(ei > USB_MAX_ENDPOINTS)
		return;
	
	usb_irq_disable(flag);
	
	set_stall(addr,1);
	
	usb_irq_enable(flag);
}

void usb_arch_halt_endpoint(uint8_t addr, int halt) {
	uint8_t ei = EP_HW_NUM(addr);
	uint8_t flag;
	USBEndpoint *ep = EP_STRUCT(addr);

	
	if(ei > USB_MAX_ENDPOINTS)
		return;
	
	if(!(ep->flags & USB_EP_FLAGS_ENABLED))
		return;
	
	usb_irq_disable(flag);
	
	if(halt) {
		ep->halted = 0x1;
		set_stall(addr,1);
	} else {
		ep->halted = 0;
		set_stall(addr,0);
		
		if(ep->buffer && (ep->buffer->flags & USB_BUFFER_HALT)) {
			ep->buffer->flags &= ~USB_BUFFER_SUBMITTED;
			if(ep->buffer->flags & USB_BUFFER_NOTIFY) {
				notify_ep_process(ep,USB_EP_EVENT_NOTIFICATION);
			}
			ep->buffer = ep->buffer->next;
		}
		if(ei) {
			usb_arch_epout_irq(EP_HW_NUM(addr));
		}
	}
	
	usb_irq_enable(flag);
}

void usb_arch_set_configuration(uint8_t usb_configuration_value) {
	// Nothing to do ? 
}

uint16_t usb_arch_get_ep_status(uint8_t addr) {
	uint8_t ei = EP_INDEX(addr);
	USBEndpoint *ep = EP_STRUCT(addr);
	
	if (ei > USB_MAX_ENDPOINTS)
		return 0;
	return ep->halted;
}

void usb_arch_set_address(uint8_t addr) {
	USBADDR = addr;
}

int usb_arch_send_pending(uint8_t addr) {
	uint8_t flag;
	uint8_t ret;
	uint8_t ei = EP_INDEX(addr);
	
	usb_irq_disable(flag);
	USBINDEX = ei;
	if(ei == 0) {
		ret = USBCS0 & USBCS0_INPKT_RDY;
	} else {
		ret = USBCSIL & USBCSIL_INPKT_RDY;
	}
	usb_irq_enable(flag);
	
	return ret;
}

static unsigned int get_receive_capacity(USBBuffer *buffer) {
	unsigned int capacity = 0;
	while(buffer && !(buffer->flags & (USB_BUFFER_IN | USB_BUFFER_SETUP | USB_BUFFER_HALT))) {
		capacity += buffer->left;
		buffer = buffer->next;
	}
	return capacity;
}

static USBBuffer *
skip_buffers_until(USBBuffer *buffer, unsigned int mask, unsigned int flags,
		   uint8_t *resp)
{
  while(buffer && !((buffer->flags & mask) == flags)) {
    buffer->flags &= ~USB_BUFFER_SUBMITTED;
    buffer->flags |= USB_BUFFER_FAILED;
    if (buffer->flags & USB_BUFFER_NOTIFY) *resp |= USB_READ_NOTIFY;
    buffer = buffer->next;
  }
  return buffer;
}

static uint8_t fill_buffers(USBBuffer * buffer, uint8_t hw_ep, unsigned int len, uint8_t short_packet) {
	unsigned int t;
	uint8_t res = 0;
	
	do {
		if(buffer->left < len) {
			t = buffer->left;
		} else {
			t = len;
		}
		len -= t;
		buffer->left -= t;
		
		read_hw_buffer(buffer->data, hw_ep, t);
		
		buffer->data += t;
		
		if(len == 0) {
			break;
		}
		
		buffer->flags &= ~(USB_BUFFER_SUBMITTED | USB_BUFFER_SHORT_PACKET);
		if(buffer->flags & USB_BUFFER_NOTIFY) {
			res |= USB_READ_NOTIFY;
		}
		buffer = buffer->next;
	} while(1);
	
	if(short_packet) {
		buffer->flags |= USB_BUFFER_SHORT_PACKET;
	}
	
	if((buffer->left == 0) || (buffer->flags & USB_BUFFER_PACKET_END)) {
		buffer->flags &= ~USB_BUFFER_SUBMITTED;
		if(buffer->flags & USB_BUFFER_NOTIFY) {
			res |= USB_READ_NOTIFY;
		}
		buffer = buffer->next;
	} else {
		if(short_packet) {
			if(buffer->left && !(buffer->flags & USB_BUFFER_SHORT_END)) {
				buffer->flags |= USB_BUFFER_FAILED;
				res |= USB_READ_FAIL;
			}
			buffer->flags &= ~USB_BUFFER_SUBMITTED;
			if(buffer->flags & USB_BUFFER_NOTIFY) {
				res |= USB_READ_NOTIFY;
			}
			buffer = buffer->next;
		}
	}
	
	usb_endpoints[hw_ep].buffer = buffer;
	
	return res;
}


static uint8_t ep0_get_setup_pkt(void) {
	// The USB controller check that the packet size is == 8
	// First get a valid setup buffer
	uint8_t res;
	USBBuffer * buffer = skip_buffers_until(usb_endpoints[0].buffer, USB_BUFFER_SETUP, USB_BUFFER_SETUP, &res);
	
	usb_endpoints[0].buffer = buffer;
	
	if(!buffer || buffer->left < 8) {
		return USB_READ_BLOCK;
	}

	read_hw_buffer(buffer->data, 0, 8);
	buffer->left -= 8;
	
	buffer->flags &= ~USB_BUFFER_SUBMITTED;
	if(buffer->flags & USB_BUFFER_NOTIFY) {
		res |= USB_READ_NOTIFY;
	}
	
	if(buffer->data[6] || buffer->data[7]) {
		// DATA stage ...
		USBCS0 |= USBCS0_CLR_OUTPKT_RDY;
		ep0Status = buffer->data[0] & 0x80 ? EP_TX : EP_RX;
	} else {
		// The usb-core will submit an empty data packet 
		// This will trigger the clr (see the buffer submission routine)
//		USBCS0 |= USBCS0_CLR_OUTPKT_RDY | USBCS0_DATA_END;
	}

	buffer->data += 8;
	
	usb_endpoints[0].buffer = buffer->next;
	
	return res;
}

static uint8_t ep0_get_data_pkt(void) {
	uint8_t res = 0;
	uint8_t short_packet = 0;
	USBBuffer * buffer = usb_endpoints[0].buffer;
	uint8_t len = USBCNT0;
	
	if(!buffer) {
		return USB_READ_BLOCK;
	} 
	
	if(buffer->flags & (USB_BUFFER_SETUP | USB_BUFFER_IN)) {
		uint8_t temp;
		buffer->flags |= USB_BUFFER_FAILED;
		buffer->flags &= ~USB_BUFFER_SUBMITTED;
		if(buffer->flags & USB_BUFFER_NOTIFY) {
			res |= USB_READ_NOTIFY;
		}
		// Flush the fifo
		while(len--) {
			temp = USBF0;
		}
		usb_endpoints[0].buffer = buffer->next;
		// Force an end to the data stage
		USBCS0 |= USBCS0_CLR_OUTPKT_RDY | USBCS0_DATA_END;
		
		ep0Status = EP_IDLE;
		return res;
	}
	
	if(get_receive_capacity(buffer) < len) {
		// Wait until we queue more buffers.
		return USB_READ_BLOCK;
	}
	
