retornaz/contiki-cc253x/cpu/cc253x/dev/usb-arch.c
	if(len < usb_endpoints[0].xfer_size) {
		short_packet = 1;
	}
	
	res = fill_buffers(buffer, 0, len, short_packet);	
	
	if(short_packet) {
		USBCS0 |= USBCS0_CLR_OUTPKT_RDY | USBCS0_DATA_END;
		ep0Status = EP_IDLE;
	} else {
		USBCS0 |= USBCS0_CLR_OUTPKT_RDY;
	}
	return res;
}

static uint8_t ep0_tx(void) {
	USBBuffer * buffer = usb_endpoints[0].buffer;
	unsigned int len = usb_endpoints[0].xfer_size;
	uint8_t data_end = 0;
	uint8_t res = 0;
	
	// If TX Fifo still busy or ep0 not in TX data stage don't do anything
	if((USBCS0 & USBCS0_INPKT_RDY) || (ep0Status != EP_TX))  {
		return 0;
	}
	
	if(!buffer) {
		return 0;
	}

	if(!(buffer->flags & USB_BUFFER_IN)) {
		return 0; // Huh .. problem ... we should TX but queued buffer is in RX ...
	}
	
	while(buffer) {
		unsigned int copy;
		if(buffer->left < len)
			copy = buffer->left;
		else
			copy = len;
		
		len -= copy;
		buffer->left -= copy;
		write_hw_buffer(0, buffer->data, copy);
		buffer->data += copy;
		if(buffer->left == 0) {
			if(buffer->flags & USB_BUFFER_SHORT_END) {
				if(len == 0)
					break; // We keep the buffer in queue so we will send a ZLP next time.
				else {
					data_end = 1;
					len = 0; // Stop looking for more data to send
				}
			}
			buffer->flags &= ~USB_BUFFER_SUBMITTED;
			if(buffer->flags & USB_BUFFER_NOTIFY)
				res |= USB_WRITE_NOTIFY;
			buffer = buffer->next;
		}
		if(len == 0)
			break; // FIFO is full, send packet.
	}
	if(len) {
		// Short packet will be sent.
		data_end = 1;
	}
	usb_endpoints[0].buffer = buffer;
	
	if(data_end) {
		ep0Status = EP_IDLE;
		USBCS0 |= USBCS0_INPKT_RDY | USBCS0_DATA_END;	
	} else {
		USBCS0 |= USBCS0_INPKT_RDY;
	}
	
	return res;
}

static void usb_arch_ep0_irq(void) {
	uint8_t cs0;
	uint8_t res;

	USBINDEX = 0;
	cs0 = USBCS0;
	if(cs0 & USBCS0_SENT_STALL) {
		// Ack the stall
		USBCS0 = 0;
		ep0Status = EP_IDLE;
	}
	if(cs0 & USBCS0_SETUP_END) {
		// Clear it
		USBCS0 = USBCS0_CLR_SETUP_END;
		ep0Status = EP_IDLE;
	}
	
	if(cs0 & USBCS0_OUTPKT_RDY) {
		if(ep0Status == EP_IDLE) {
			res = ep0_get_setup_pkt();
		} else {
			res = ep0_get_data_pkt();
		}

		if(res & USB_READ_NOTIFY) {
			notify_ep_process(&usb_endpoints[0], USB_EP_EVENT_NOTIFICATION);
		}
		if(res & USB_READ_BLOCK) {
			usb_endpoints[0].flags |= USB_EP_FLAGS_DATA_WAITING;
			return;
		} else {
			usb_endpoints[0].flags &= ~USB_EP_FLAGS_DATA_WAITING;
		}
	}
	
	// Trigger the TX path
	res = ep0_tx();

	if(res & USB_WRITE_NOTIFY) {
		notify_ep_process(&usb_endpoints[0], USB_EP_EVENT_NOTIFICATION);
	}
}


static uint8_t ep_tx(uint8_t ep_hw) {
	unsigned int len;
	uint8_t res = 0;
	USBEndpoint *ep = EP_STRUCT(ep_hw);
	len = ep->xfer_size;
	
	if(ep->halted)
		return 0;
	
	if(!ep->buffer || !(ep->buffer->flags & USB_BUFFER_IN)) 
		return 0;
	
	while(ep->buffer) {
		unsigned int copy;
		if(ep->buffer->left < len)
			copy = ep->buffer->left;
		else
			copy = len;
		
		len -= copy;
		ep->buffer->left -= copy;
		write_hw_buffer(EP_INDEX(ep_hw), ep->buffer->data, copy);
		ep->buffer->data += copy;
		if(ep->buffer->left == 0) {
			if(ep->buffer->flags & USB_BUFFER_SHORT_END) {
				if(len == 0)
					break; // We keep the buffer in queue so we will send a ZLP next time.
				else {
					len = 0; // Stop looking for more data to send
				}
			}
			ep->buffer->flags &= ~USB_BUFFER_SUBMITTED;
			if(ep->buffer->flags & USB_BUFFER_NOTIFY)
				res |= USB_WRITE_NOTIFY;
			ep->buffer = ep->buffer->next;
		}
		if(len == 0)
			break; // FIFO is full, send packet.
	}

	USBCSIL |= USBCSIL_INPKT_RDY;
	
	return res;
	
}

static uint8_t ep_get_data_pkt(uint8_t ep_hw) {
	uint16_t pkt_len;
	uint8_t res;
	uint8_t short_packet = 0;
	USBEndpoint *ep = EP_STRUCT(ep_hw);
	
	if(!ep->buffer) {
		return USB_READ_BLOCK;
	}
	
	if(ep->buffer->flags & USB_BUFFER_HALT) {
		ep->halted = 1;
		if(!(USBCSOL & USBCSOL_SEND_STALL))
			USBCSOL |= USBCSOL_SEND_STALL;
		return 0;
	}
	
	pkt_len = USBCNTL | (USBCNTH << 8);
	if(get_receive_capacity(ep->buffer) < pkt_len) {
		return USB_READ_BLOCK;
	}
	
	if(pkt_len < ep->xfer_size) {
		short_packet = 1;
	}
	
	res = fill_buffers(ep->buffer, ep_hw, pkt_len, short_packet);
	
	USBCSOL &= ~USBCSOL_OUTPKT_RDY;
	
	return res;
}

static void usb_arch_epout_irq(uint8_t ep_hw) {
	// RX interrupt
	uint8_t csl;
	uint8_t res;
	USBEndpoint *ep = EP_STRUCT(ep_hw);

	
	USBINDEX = ep_hw;
	csl = USBCSOL;
	
	if(csl & USBCSOL_SENT_STALL) {
		USBCSOL &= ~USBCSOL_SENT_STALL;
	}
	
	if(csl & USBCSOL_OVERRUN) {
		// We lost one isochronous packet ... 
		USBCSOL &= ~USBCSOL_OVERRUN;
	}
	
	if(csl & USBCSOL_OUTPKT_RDY) {
		res = ep_get_data_pkt(ep_hw);
		if(res & USB_READ_NOTIFY) {
			notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
		}
		if(res & USB_READ_BLOCK) {
			ep->flags |= USB_EP_FLAGS_DATA_WAITING;
		} else {
			ep->flags &= ~USB_EP_FLAGS_DATA_WAITING;
		}
	}
}

static void usb_arch_epin_irq(uint8_t ep_hw) {
	uint8_t csl;
	uint8_t res;
	USBEndpoint * ep = EP_STRUCT(ep_hw);
	// TX interrupt
	
	USBINDEX = ep_hw;
	csl = USBCSIL;
	
	if(csl & USBCSIL_SENT_STALL) {
		USBCSIL &= ~USBCSIL_SENT_STALL;
	}
	
	if(csl & USBCSIL_UNDERRUN) {
		USBCSIL &= ~USBCSIL_UNDERRUN;
	}
	
	if(!(csl & USBCSIL_INPKT_RDY)) {
		res = ep_tx(ep_hw);
		if(res & USB_WRITE_NOTIFY) {
			notify_ep_process(ep, USB_EP_EVENT_NOTIFICATION);
		}
	}
}

#define EPxIF(x)        (1 << x)
#define RSTIF           (1 << 2)
#define RESUMEIF        (1 << 1)
#define SUSPENDIF       (1 << 0)

uint8_t usb_irq(void)
{
        uint8_t ep_in_if = USBIIF & USBIIE;
        uint8_t ep_out_if = USBOIF & USBOIE;
        uint8_t common_if = USBCIF & USBCIE;
        uint8_t i;
	
        if(ep_in_if) {
                /* EP0 is routed on IN irq flags */
                if(ep_in_if & 0x1) {
                        usb_arch_ep0_irq();
                }
                for(i = 1; i < 6; i++) {
                        if(ep_in_if & EPxIF(i)) {
                                usb_arch_epin_irq(i);
                        }
                }
        }
        if(ep_out_if) {
                for(i = 1; i < 6; i++) {
                        if(ep_out_if & EPxIF(i)) {
                                usb_arch_epout_irq(i);
                        }
                }
        }
        if(common_if & RSTIF) {
		usb_arch_reset();
		notify_process(USB_EVENT_RESET);
        }
        if(common_if & RESUMEIF) {
		notify_process(USB_EVENT_RESUME);
        }
        if(common_if & SUSPENDIF) {
		notify_process(USB_EVENT_SUSPEND);
        }

	return ep_in_if || ep_out_if || common_if ? CC253x_P2_ACK : CC253x_P2_NACK;
}
